Noah-Butler18/Water-Quality-Analyzer-v2/Water_Quality_Analyzer/Drivers/Src/stm32f407vg_adc_driver.c
/*
 * stm32f407vg_adc_driver.c
 *
 *  Created on: May 17, 2024
 *      Author: butle
 */

#include "stm32f407vg_adc_driver.h"

/*********** Driver-specific helper functions prototype section ***********/
static void ADC_SampleTimeInit(ADC_Handle_t *pADCHandle);
static void ADC_tStabDelay(void);
static void ADC_HandleRead(ADC_Handle_t *pADCHandle);

/********************************************************/




/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_PeriClockControl

 	 * @brief  		- enables or disables the clock of a ADC peripheral

 	 * @param 		- *pADCx : ADC peripheral base address in MCU memory
 	 * @param  		- EnOrDi : macros to enable or disable the clock (ENABLE or DISABLE macros are in MCU specific header file)

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_PeriClockControl(ADC_RegDef_t *pADCx, uint8_t EnOrDi)
{
	if( EnOrDi == ENABLE )
	{
		if( (uint32_t) pADCx == ADC1_BASE_ADDR )
		{
			ADC1_PCLK_EN();
		}
		else if ( (uint32_t) pADCx == ADC2_BASE_ADDR )
		{
			ADC2_PCLK_EN();
		}
		else if ( (uint32_t) pADCx == ADC3_BASE_ADDR )
		{
			ADC3_PCLK_EN();
		}
		else
			;
	}
	else
	{
		if( (uint32_t) pADCx == ADC1_BASE_ADDR )
		{
			ADC1_PCLK_DI();
		}
		else if ( (uint32_t) pADCx == ADC2_BASE_ADDR )
		{
			ADC2_PCLK_DI();
		}
		else if ( (uint32_t) pADCx == ADC3_BASE_ADDR )
		{
			ADC3_PCLK_DI();
		}
		else
			;
	}
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_PeripheralOnOffControl

 	 * @brief  		- API that turns on or off the ADCx peripheral

 	 * @param 		- *pADCx : ADC peripheral base address in MCU memory
 	 * @param 		- EnOrDi : User-inputted value to enable or disable the device's ADC peripheral

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_PeripheralOnOffControl(ADC_RegDef_t *pADCx, uint8_t EnOrDi)
{
	if( EnOrDi == ENABLE )
	{
		pADCx->CR2 |= (1 << ADC_CR2_ADON);

		//Wait tSTAB time for ADC to stabilize after being turned on (approx 3us - see data sheet table 67)
		ADC_tStabDelay();
	}
	else if( EnOrDi == DISABLE )
	{
		pADCx->CR2 &= ~(1 << ADC_CR2_ADON);
	}
	else
		;
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_GetFlagStatus

 	 * @brief  		- API that returns that value of a specific flag in the ADC peripheral status registers

 	 * @param 		- *pADCx : ADC peripheral base address in MCU memory
 	 * @param 		- FlagName : Name of the desired flag you want to check the status of

 	 * @retval 		- data that is read from flag - can only be either 1 or 0 (set or reset)

 	 * @Note		- none

*/
uint8_t ADC_GetFlagStatus(ADC_RegDef_t *pADCx, uint32_t FlagName)
{
	if(	pADCx->SR & FlagName ) return FLAG_SET;
	else return FLAG_RESET;
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_ClearFlag

 	 * @brief  		- Helper API that performs a software clear of an ADC status flag

 	 * @param 		- *pADCx : ADC peripheral base address in MCU memory
 	 * @param 		- FlagName : Name of the desired flag you want to clear

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_ClearFlag(ADC_RegDef_t *pADCx, uint32_t FlagName)
{
	switch( FlagName )
	{
		case ADC_FLAG_AWD:
			pADCx->SR &= ~( 1 << ADC_SR_AWD );
			break;

		case ADC_FLAG_JEOC:
			pADCx->SR &= ~( 1 << ADC_SR_JEOC );
			break;

		case ADC_FLAG_JSTRT:
			pADCx->SR &= ~( 1 << ADC_SR_JSTRT );
			break;

		case ADC_FLAG_STRT:
			pADCx->SR &= ~( 1 << ADC_SR_STRT );
			break;

		case ADC_FLAG_OVR:
			pADCx->SR &= ~( 1 << ADC_SR_OVR );
			break;

		default:
			break;
	}
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_Init

 	 * @brief  		- API that initializes a specific ADC peripheral as well as the common ADC registers with
 	 * 				- programmer-defined values from the ADC_Config_t structure

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_Init(ADC_Handle_t *pADCHandle)
{
	// 0. Turn on peripheral clock
	ADC_PeriClockControl(pADCHandle->pADCx, ENABLE);

	//0.5 Turn on ADC
	ADC_PeripheralOnOffControl(pADCHandle->pADCx, ENABLE);


	uint32_t tempreg = 0;

	// 1. Configure clock APB2 clock prescaler for ADCCLK
	tempreg |= ( pADCHandle->ADC_Config.ADC_ClkPrescaler << ADC_CCR_ADCPRE_1_0 );
	ADCCOMMON->CCR |= tempreg;

	// 2. Configure ADC data register resolution
	tempreg = 0;
	tempreg |= ( pADCHandle->ADC_Config.ADC_Resolution << ADC_CR1_RES_1_0 );
	pADCHandle->pADCx->CR1 |= tempreg;

	// 3. Configure data register bit alignment
	tempreg = 0;
	tempreg |= ( pADCHandle->ADC_Config.ADC_DataAlignment << ADC_CR2_ALIGN );
	pADCHandle->pADCx->CR2 |= tempreg;

	// 4. Configure ADC mode

	if( pADCHandle->ADC_Config.ADC_Mode == ADC_SINGLE_CONVERSION_MODE )
	{
		//a. Single conversion mode

		//4.1a Set CONT bit to 0
		pADCHandle->pADCx->CR2 &= ~(1 << ADC_CR2_CONT);
	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_CONT_CONVERSION_MODE )
	{
		//b. Continuous conversion mode

		//4.1b Set CONT bit to 1
		pADCHandle->pADCx->CR2 |= (1 << ADC_CR2_CONT);
	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_SCAN_CONVERSION_MODE )
	{
		//c. Scan conversion mode

		//4.1c Set CONT bit to 0 IF YOU ONLY WANT 1 CONVERSION PER IRQ TRIGGER
		pADCHandle->pADCx->CR2 &= ~(1 << ADC_CR2_CONT);

		//4.2c Set scan bit = 1
		pADCHandle->pADCx->CR1 |= (1 << ADC_CR1_SCAN );
	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_DISCONT_CONVERSION_MODE )
	{
		//d. Discontinuous conversion mode
	}

	// 5. Configure ADC sequence length and order

		//a. Configure sequence conversion length
		tempreg = 0;
		tempreg = ( pADCHandle->ADC_Config.ADC_Seq_Len << ADC_SQR1_L_3_0 );

		if( ( pADCHandle->ADC_Config.ADC_Seq_Len ) > 15)
		{
			//Cannot have a sequence of regular ADC conversions longer than 16 - See RM 13.3.3. If invalid number, enter into an infinite loop.
			while(1);
		}

		pADCHandle->pADCx->SQR1 |= tempreg;

		//b. Configure channel conversion sequence

		ADC_SequenceInit(pADCHandle);


	// 6. Configure ADC sampling time
	ADC_SampleTimeInit(pADCHandle);

	// 7. Enable and configure analog watch dog higher and lower threshold values (interrupts enabled in ADC_ConvertIT API)
	pADCHandle->pADCx->CR1 |= ( 1 << ADC_CR1_AWDEN );

	tempreg = 0;
	tempreg = pADCHandle->ADC_Config.ADC_AWDHT;
	pADCHandle->pADCx->HTR = tempreg;

	tempreg = 0;
	tempreg = pADCHandle->ADC_Config.ADC_AWDLT;
	pADCHandle->pADCx->LTR |= tempreg;


	//8. Enable overrun detection (interrupts enabled in ADC_ConvertIT API)
	//This also configures the EOC status bit to be set after each conversion and not just at the end of the sequence
	pADCHandle->pADCx->CR2 |= ( 1 << ADC_CR2_EOCS );
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_DeInit

