Noah-Butler18/Water-Quality-Analyzer-v2/Water_Quality_Analyzer/Drivers/Src/stm32f407vg_adc_driver.c
 	 * @brief  		- API that writes reset values into all of an ADC peripheral's registers

 	 * @param 		- none

 	 * @retval 		- none

 	 * @Note		- ADC interface reset is common to all ADCs - all ADC's peripheral registers will be reset

*/
void ADC_DeInit(void)
{
	ADC_REG_RESET();
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_Init

 	 * @brief  		- API that starts, waits, and reads one or more analog conversions

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values
 	 * @param 		- *pRxBuffer : user-application buffer used to read in digitally-converted value from the ADC's data register

 	 * @retval 		- none

 	 * @Note		- This is a blocking function

*/
void ADC_Read(ADC_Handle_t *pADCHandle, uint16_t *pRxBuffer)
{
	//1. Determine what kind of mode the ADC is in

	if( pADCHandle->ADC_Config.ADC_Mode == ADC_SINGLE_CONVERSION_MODE )
	{
		//1.1 Start sampling input voltage
		//If already sampling, something has gone wrong. Issue application event

		if( ADC_GetFlagStatus( pADCHandle->pADCx, ADC_FLAG_STRT ) )
		{
			ADC_ApplicationEventCallBack(pADCHandle, ADC_ERROR_STRT);
		}

		ADC_StartADC( pADCHandle );

		//1.2 If a regular channel was converted, check for end of conversion flag and read data register into buffer

		while( !( ADC_GetFlagStatus( pADCHandle->pADCx, ADC_FLAG_EOC ) ) )
			;

		*(pRxBuffer) = (uint16_t) pADCHandle->pADCx->DR;

		//1.3 Once regular channel has been converted, clear STRT flag
		ADC_ClearFlag(pADCHandle->pADCx, ADC_FLAG_STRT);

	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_CONT_CONVERSION_MODE )
	{
		;
	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_SCAN_CONVERSION_MODE )
	{
		;
	}
	else if( pADCHandle->ADC_Config.ADC_Mode == ADC_DISCONT_CONVERSION_MODE )
	{
		;
	}

}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_IRQConfig

 	 * @brief  		- API that configures interrupts generated by a ADC. This function handles the configurations needed for interrupts on the processor side
 	 * 				- Refer to processor guide here for more details: https://www.engr.scu.edu/~dlewis/book3/docs/Cortex-M4_Devices_Generic_User_Guide.pdf

 	 * @param 		- IRQNumber : Number associated with the peripheral's exception handler in the NVIC vector table
 	 * @param 		- EnOrDi : macros to enable or disable the IRQ (ENABLE or DISABLE macros in MCU specific header file

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnOrDi)
{
	if(EnOrDi == ENABLE)
	{
		if(IRQNumber <= 31)
		{
			//configure ISER0 register in processor //0 to 31
			*NVIC_ISER0 |= ( 1 << IRQNumber );
		}
		else if(IRQNumber > 31 && IRQNumber <= 63)
		{
			//configure ISER1 register in processor //32 to 63
			*NVIC_ISER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber > 63 && IRQNumber <= 95)
		{
			//configure ISER2 register in processor //64 to 95
			*NVIC_ISER2 |= ( 1 << (IRQNumber % 32) );
		}
	}
	else
	{
		if(IRQNumber <= 31)
		{
			//configure ICER0 register in processor //0 to 31
			*NVIC_ICER0 |= ( 1 << IRQNumber );
		}
		else if(IRQNumber > 31 && IRQNumber <= 63)
		{
			//configure ICER1 register in processor //32 to 63
			*NVIC_ICER1 |= ( 1 << (IRQNumber % 32) );
		}
		else if(IRQNumber > 63 && IRQNumber <= 95)
		{
			//configure ICER2 register in processor //64 to 95
			*NVIC_ICER2 |= ( 1 << (IRQNumber % 32) );
		}
	}
}


/*********************** Function Documentation ***************************************
 *
	 * @fn			- ADC_IRQPriorityConfig

	 * @brief  		- API that configures the priority level of a given IRQ (ADC-driven interrupt).

	 * @param 		- IRQPriority : Value that contains priority level of interrupt as compared to other interrupts. Similar to ADC_IRQInterruptConfig, this is also handled on the processor side in Cortex-M4 internal peripheral registers
	 * @param		- IRQNumber : Number associated with the peripheral's exception handler in the NVIC vector table

	 * @retval 		- none

	 * @Note		- none

*/
void ADC_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority)
{
	//1. Find out which IPR register the IRQ is in
	uint8_t Offset = IRQNumber / 4;

	//2. Clear and write by shifting the priority value into the correct position
	uint8_t temp = (IRQNumber % 4) * 8;

	uint8_t shiftAmount = temp + ( 8 - NO_PR_BITS_IMPLEMENTED );															//Note: In the Cortex-M4, only 4 most significant bits of each of the 4 "sections" in the Interrupt priority register (IPR) are implemented, not the last 4. Because if this, you are limited to only 16 priority levels instead of 256 (this was for cost savings apparently). Keeping this in mind, you must also shift whatever priority level desired over to the left by 4 bits no matter the section of the byte it is in.
	*(NVIC_IPR_BASE_ADDR + (Offset) ) &= ~( 0xFF << shiftAmount );														//Clear the existing priority level
	*(NVIC_IPR_BASE_ADDR + (Offset) ) |= ( IRQPriority << shiftAmount );												//Write the desired priority level
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_EnableIT

 	 * @brief  		- API that enables interrupts generated by ADC peripheral.

 	 * @param 		- pADCHandle : Contains ADC peripheral base address in MCU memory as well as other global variables
 	 * @param 		- ConvBuffer : Contains address of user data buffer
 	 * @param 		- length : Contains address of user data buffer

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_EnableIT(ADC_Handle_t *pADCHandle, uint16_t *ConvBuffer, uint8_t Length)
{
	//0. Configure address of global driver buffer to user buffer so that driver has access to change its values
	pADCHandle->pADC_DataBuffer = ConvBuffer;

	//0.5 Copy number of conversions per sequence (length) into global handler that can be seen by interrupt routines
	pADCHandle->ADC_SeqLen = Length;


	//Enable interrupts as non-polling means of alerting program that analog conversion is complete, error has occurred, etc.

