Noah-Butler18/Water-Quality-Analyzer-v2/Water_Quality_Analyzer/Drivers/Src/stm32f407vg_adc_driver.c
	//1. Enable EOCS flag (end of conversion) interrupts
	pADCHandle->pADCx->CR1 |= ( 1 << ADC_CR1_EOCIE );

	//2. Enable Watch dog high and low threshold flag interrupts
	pADCHandle->pADCx->CR1 |= ( 1 << ADC_CR1_AWDIE );

	//3. Enable overrun flag interrupts
	pADCHandle->pADCx->CR1 |= ( 1 << ADC_CR1_OVRIE );


	//5. Start ADC conversion - if already converting, issue a warning
	if( ADC_GetFlagStatus(pADCHandle->pADCx, ADC_FLAG_STRT) )
	{
		ADC_ApplicationEventCallBack(pADCHandle, ADC_ERROR_STRT);
	}

	ADC_StartADC(pADCHandle);
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_DisableIT

 	 * @brief  		- API that disables interrupts generated by ADC peripheral.

 	 * @param 		- pADCHandle : Contains ADC peripheral base address in MCU memory as well as other global variables

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_DisableIT(ADC_Handle_t *pADCHandle)
{
	//0. Reset handle structure in preparation of future data
	pADCHandle->pADC_DataBuffer = NULL;
	pADCHandle->ADC_SeqLen = 0;

	//Disable interrupts

	//1. Disable EOCS flag (end of conversion) interrupts
	pADCHandle->pADCx->CR1 &= ~( 1 << ADC_CR1_EOCIE );

	//2. Disable Watch dog high and low threshold flag interrupts
	pADCHandle->pADCx->CR1 &= ~( 1 << ADC_CR1_AWDIE );

	//3. Disable overrun flag interrupts
	pADCHandle->pADCx->CR1 &= ~( 1 << ADC_CR1_OVRIE );


	//4. Turn off ADC
	ADC_PeripheralOnOffControl( (pADCHandle->pADCx) , DISABLE);
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_IRQHandling

 	 * @brief  		- API that handles interrupts generated by ADC peripheral.

 	 * @param 		- pADCHandle : Contains ADC peripheral base address in MCU memory as well as other global variables

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_IRQHandling(ADC_Handle_t *pADCHandle)
{
	//Temporary variables to make sure interrupts are enabled
	uint8_t temp1 = ( pADCHandle->pADCx->CR1 & ( 1 << ADC_CR1_EOCIE ) );
	uint8_t temp2 = ( pADCHandle->pADCx->CR1 & ( 1 << ADC_CR1_AWDIE ) );
	uint32_t temp3 = ( pADCHandle->pADCx->CR1 & ( 1 << ADC_CR1_OVRIE ) );


	if( ADC_GetFlagStatus(pADCHandle->pADCx, ADC_FLAG_OVR) && temp3 )
	{
		//1. Check if the interrupt was triggered by "overrun" flag

		//1.1 Behavior of an overrun event defined by user
		ADC_ApplicationEventCallBack(pADCHandle, ADC_EVENT_OVR);
	}


	if( ADC_GetFlagStatus(pADCHandle->pADCx, ADC_FLAG_AWD) && temp2 )
	{
		//2. Check if the interrupt was triggered by "analog watch dog threshold" flag

		//2.1 Behavior of an analog watch dog threshold event defined by user
		ADC_HandleRead(pADCHandle);

		ADC_ApplicationEventCallBack(pADCHandle, ADC_EVENT_AWD);
	}


	if( ADC_GetFlagStatus(pADCHandle->pADCx, ADC_FLAG_EOC) && temp1 )
	{
		//3. Check if the interrupt was triggered by "end of conversion" flag

		//3.1 Check if sequence has more than 1 conversions left in it
		if( ( pADCHandle->ADC_SeqLen ) > 1 )
		{
			//3.2 if there is more than 1 conversions left in sequence, continue with conversions

			ADC_HandleRead(pADCHandle);

			//3.2.1 Decrement length of sequence tracker
			pADCHandle->ADC_SeqLen--;
		}
		else if( ( pADCHandle->ADC_SeqLen ) == 1 )
		{
			//3.3 if there is only 1 conversion left in sequence, finish converting last analog value and then turn off interrupts and ADC

			ADC_HandleRead(pADCHandle);

			//3.3.1 Disable interrupts and turn off ADC
			ADC_DisableIT(pADCHandle);

			//The purpose of this is that when the timer interrupt is triggered, it will turn on the ADC and the ADC interrupts.
			//Because this is meant for a non-continuous application, this will save power in the down time
		}

		//NOTE: EOC flag should automatically be cleared by software read of DR

		//Handler for more than 1 conversion - must be implemented in user application
		ADC_ApplicationEventCallBack(pADCHandle, ADC_EVENT_EOC);
	}


}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_StartADC

 	 * @brief  		- Helper API that starts the conversion on the ADC

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values

 	 * @retval 		- none

 	 * @Note		- API only starts conversion of regular channels, not injected ones

*/
void ADC_StartADC(ADC_Handle_t *pADCHandle)
{
	uint8_t temp = ( pADCHandle->pADCx->CR2 & ( 1 << ADC_CR2_ADON ) );

	if( !temp )
	{
		ADC_PeripheralOnOffControl(pADCHandle->pADCx, ENABLE);
	}

	// Set ADC to start converting - if already converting, issue an application event

	if( ADC_GetFlagStatus(pADCHandle->pADCx, ADC_FLAG_STRT) )
	{

		ADC_ApplicationEventCallBack(pADCHandle, ADC_ERROR_STRT);
	}

	pADCHandle->pADCx->CR2 |= ( 1 << ADC_CR2_SWSTART );

	//ADC_CR2_SWSTART is a read-write bit that set by software to start conversion and cleared by hardware as soon as the conversion starts
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_ApplicationEventCallBack

 	 * @brief  		- API that takes specific course of action if an event has happened

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values
 	 * @param 		- AppEvent : argument containing the specific event or condition that has occurred

 	 * @retval 		- none

 	 * @Note		- Weak driver implementation can be overwritten by user for their own purposes

*/
__weak void ADC_ApplicationEventCallBack(ADC_Handle_t *pADCHandle, uint8_t AppEvent)
{
	//This is a weak implementation. The application may overwrite this function.
}



/*-------------------- Driver-specific helper functions definition section --------------------*/


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_SequenceInit

 	 * @brief  		- Helper API that writes the ADC's SQR1-SQR3 registers with the number and order of channels specified by the user

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values

 	 * @retval 		- none

 	 * @Note		- none

*/
void ADC_SequenceInit(ADC_Handle_t *pADCHandle)
{
	//Configures channel conversion sequence
	//Scheme: Use ADC_Seq_Len to determine how many ADC_SQRx bit fields to write into.

	//Clear SQRx registers
	pADCHandle->pADCx->SQR1 = 0;
	pADCHandle->pADCx->SQR2 = 0;
	pADCHandle->pADCx->SQR3 = 0;

