Noah-Butler18/Water-Quality-Analyzer-v2/Water_Quality_Analyzer/Drivers/Src/stm32f407vg_adc_driver.c
	uint8_t Sequence_Length = pADCHandle->ADC_Config.ADC_Seq_Len;
	uint32_t temp = 0;


	while( Sequence_Length > 12 )
	{
		temp |= pADCHandle->ADC_Config.ADC_Seq_Order[Sequence_Length-1] << ( ( Sequence_Length - 13 ) * 5 );
		Sequence_Length--;
	}
	pADCHandle->pADCx->SQR1 |= temp;
	temp = 0;


	while( Sequence_Length > 6 )
	{
		temp |= pADCHandle->ADC_Config.ADC_Seq_Order[Sequence_Length-1] << ( ( Sequence_Length - 7 ) * 5 );
		Sequence_Length--;
	}
	pADCHandle->pADCx->SQR2 |= temp;
	temp = 0;


	while( Sequence_Length > 0 )
	{
		temp |= pADCHandle->ADC_Config.ADC_Seq_Order[Sequence_Length-1] << ( ( Sequence_Length - 1 ) * 5 );
		Sequence_Length--;
	}
	pADCHandle->pADCx->SQR3 |= temp;

}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_SampleTimeInit

 	 * @brief  		- Helper API that writes the ADC's SMPR1-SMPR2 registers with the sampling time of channels specified by the user

 	 * @param 		- *pADCHandle : contains ADC peripheral base address in MCU memory as well as configuration values

 	 * @retval 		- none

 	 * @Note		- none

*/
static void ADC_SampleTimeInit(ADC_Handle_t *pADCHandle)
{
	//Configures conversion sampling time for each channel

	uint8_t len = pADCHandle->ADC_Config.ADC_Seq_Len;
	uint8_t i = 0;
	uint8_t channel_index;
	uint32_t tempreg = 0;

	while( len )
	{
		tempreg = 0;
		channel_index = pADCHandle->ADC_Config.ADC_Seq_Order[i];
		tempreg |= pADCHandle->ADC_Config.ADC_SamplingTime[channel_index];

		if( channel_index > 9 )
		{
			tempreg <<= ( ( channel_index - 10 ) * 3 );
			pADCHandle->pADCx->SMPR1 |= tempreg;

		}
		else
		{
			tempreg <<= ( channel_index * 3 );
			pADCHandle->pADCx->SMPR2 |= tempreg;
		}

	len--;
	i++;

	}
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_tStabDelay

 	 * @brief  		- Helper API that delays execution of ADC software to allow ADC's hardware to stabilize

 	 * @param 		- none

 	 * @retval 		- none

 	 * @Note		- none

*/
static void ADC_tStabDelay(void)
{
	//Use timers to get more precise delay

	uint32_t t = 3000;

	while(t--);
}


/*********************** Function Documentation ***************************************
 *
 	 * @fn			- ADC_ConversionRead

 	 * @brief  		- Helper API that converts data in DR to accurate data and then stores value in user data buffer
 	 *
 	 * @param 		- pADCHandle : Contains ADC peripheral base address in MCU memory as well as address of user buffer

 	 * @retval 		- none

 	 * @Note		- none

*/
static void ADC_HandleRead(ADC_Handle_t *pADCHandle)
{
	//1. Check resolution & data alignment to mask data register correctly
	uint8_t resolution = ( ( pADCHandle->pADCx->CR1 >> ADC_CR1_RES_1_0 ) & (0x3) );
	uint8_t alignment = ( ( pADCHandle->pADCx->CR1 >> ADC_CR2_ALIGN ) & (0x1) );

	//2. Calculate right-shift amount in case of left aligned bits
	uint8_t shiftAmt = 4 + ( resolution * 2 );

	//2.5. Calculate mask value
	uint16_t maskVal = ( 0xFFF >> (resolution * 2) );


	uint16_t tempreg = 0;

	//3. Check alignment
	if( alignment )
	{
		//4. Left aligned bits

		if( resolution == 3)
		{
			//4.1 Check for special case: 6-bit DR resolution
			//Right shift by 2, then mask the last 6 bits and assign value to user buffer

			tempreg = (uint16_t) ( (pADCHandle->pADCx->DR) >> 0x2 );
			*(pADCHandle->pADC_DataBuffer) = ( tempreg & maskVal );
		}
		else
		{
			//4.2 Normal case: 12, 10, or 8 bit DR resolution
			//Right shift by shiftAmt, then mask appropriate number of bits and assign value to user buffer

			tempreg = (uint16_t) ( (pADCHandle->pADCx->DR) >> shiftAmt );
			*(pADCHandle->pADC_DataBuffer) = ( tempreg & maskVal );
		}
	}
	else
	{
		//5. Right aligned bits

		//5.1 Mask bits appropriately and assign value to user buffer

		tempreg = (uint16_t) (pADCHandle->pADCx->DR);
		*(pADCHandle->pADC_DataBuffer) = ( tempreg & maskVal );
	}

	//Increment user data buffer
	pADCHandle->pADC_DataBuffer++;

}

/*----------------------------------------------------------------------------------------------------*/
